[{"date": "08.04.2022 14:29", "description": "ΑΝΩΓΙΑ ΚΑΤΟΙΚΙΑ/UPPER HOUSEΚΛΗΜΑΤΙΣΤΙΚΑ/A/CΘΕΡΜΑΝΣΗ/CENTRAL HEATING3 ΥΠΝΟΔΩΜΑΤΙΑ/3 BEDROOMSΜΕΓΑΛΟΙ ΧΩΡΟΙ/BIG ROOMSΟΧΙ ΜΕΣΙΤΕΣ/NO AGENTS", "id": "4119914", "location": "Famagusta district, Paralimni", "price": "750.00", "title": "3-bedroom town house to rent", "url": "www.bazaraki.com/adv/4119914_3-bedroom-town-house-to-rent/"}, {"date": "04.05.2022 14:06", "description": "The apartment is located 350m from the beachfront in Kato paphos. One of the most popular locations of the city. The apartment is one the highest quality properties on the marketing featuring:-Smart home system-Underfloor heating-Outdoor heated pool-Covered parking space-Fully airconditioned (VRV)-Fully serviced and fully equiped-Fast wifi internet-Full kitchen equipment, white goods, bed premium bedlinensIt can be rented for periods ranging between 1 - 12 months or more.The apartment features 3 bedroom, 2 bathroom, bed linen, towels, a flat-screen TV, a dining area, a fully equipped kitchen, and a balcony with sea and city viewsThe apartment is ideal for business executives, digital nomads or busy people as there is everything included. Its ready to move in!Popular points of interest nearby include SODAP Beach, Kings Avenue Mall and Medieval Castle of Paphos.", "id": "4132390", "location": "Paphos district, Paphos - Kato Paphos", "price": "2500.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4132390_3-bedroom-apartment-to-rent/"}, {"date": "Yesterday 09:07", "description": "Modern Two bedroom flat in Engomi, Nicosia Behind Apollonio Hospital. There are two bedrooms with the master benefiting from en-suite facilities and also a family bathroom, an open plan living and dining area, large covered veranda, storage room and a covered parking. Located within a small residential development. Please contact our real estate agent to arrange a viewing.", "id": "3998534", "location": "Lefkosia (Nicosia) district, Egkomi - Makedonitissa", "price": "750.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/3998534_2-bedroom-apartment-to-rent/"}, {"date": "29.04.2022 16:25", "description": "The flat is available for long term rentals. Located in a nice area in Larnaca Kamares, close to amenities. The space is partly furnished . The price includes common charges . 1 bathroom Shower. 1 Bedroom. 1 Parking private. 1 Storage.", "id": "4150827", "location": "Larnaca district, Larnaka - Kamares", "price": "650.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4150827_1-bedroom-apartment-to-rent/"}, {"date": "04.05.2022 13:54", "description": "Just bring your suitcase and start living!Fully furnished, fully equipped bright 2 bedroom apartment with tons of natural light located in the Agios Nektarios area in Limassol is ready to welcome you. Get a key and start enjoying the city’s charming vibes!A fully renovated apartment, with cozy interior designs and stylish modern furniture, luxury linen and towels in a peaceful neighborhood is waiting for you to join. The Staycaee ’s luxury outdoor furniture will allow you to relax and enjoy the breathtaking panoramic views of the city and gardens of this peaceful neighborhood. Ideal for business professionals or a family.City Gardens building is close to lots of amenities and shops, with a walking distance to coffee shops, pharmacy, mini markets and more.Start living with Staycaee and enjoy the exceptional amenities of this apartment:• Smart TV• Full electrical appliances • Fully equipped kitchen • Huge balconies with sitting areas • Fast internet • A/C in all areas• Alarm system • Entrance camera system Building amenities:• Elevator• Cleaning services • Laundry services• Customer Service Support• Covered parking areaThe apartment can be rented from 1 - 12 months on flexible contract. Internet and common expenses included. - 150m from Makarios street - main office district- 2km from the beachfront and the marina- 1.5km from enaerios street (street full of restaurants, bars)", "id": "4157614", "location": "Limassol district, Historical Center", "price": "2700.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4157614_2-bedroom-apartment-to-rent/"}, {"date": "Yesterday 11:19", "description": "Brand New amazing 2 bedroom apartment Located in Protaras.The property s part of a complex with common pool chilling area.Good location nice views, fully furnished and equipped property .wide windows and bright rooms.All the rooms have AC's.Property available for long term rental .", "id": "4159161", "location": "Famagusta district, Paralimni", "price": "850.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4159161_2-bedroom-apartment-to-rent/"}, {"date": "02.05.2022 15:48", "description": "This modern 3 bedrooms apartment in Strovolos area of Nicosia is available for rent. The property is on the second floor and consists of a spacious living room, open plan modern kitchen, three bedrooms, guest wc, a main full bathroom with rain shower, master bedroom with en-suite rain shower and walk in closet. There are 2 covered parking and storage room. Further, the apartment is equipped with all electrical appliances such as oven, electric cooker, refrigerator, dishwasher and washing machine. The apartment also has secured and coded entrance, electric shutters, solar panels, water pressure system, underfloor heating, alarm system and security door. No pets allowed. This Property is Listed By Property Pins Real Estate Ltd, a licensed real estate agent with Registration No.: 1025 License No.: 519/E", "id": "4154937", "location": "Lefkosia (Nicosia) district, Strovolos - Agios Vasileios", "price": "1800.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4154937_3-bedroom-apartment-to-rent/"}, {"date": "28.04.2022 15:29", "description": "Located in the heart of Nicosia, the whole floor apartment comprises three king size bedrooms in a central located neighborhood. Only a 5 min walk to all the coffee shops and restaurants in the busy area of the city center. Close to all shops and amenities (schools, banks, post office) and within walking distance from all the commercial streets of Nicosia, you’re at the epicenter of upscale shopping and fine dining. The apartment measures 150m2 in size with an additional 80m2 of a veranda. The apartment is inclusive of autonomous central heating, new branded electrical appliances in the kitchen, A/C all over. Three well sized verandas with 270 degrees angle view of the city. Note that the apartment was recently renovated and painted. Will be offered semi furnished. This Property is Listed By Property Pins Real Estate Ltd, a licensed real estate agent with Registration No.: 1025 License No.: 519/E", "id": "4148945", "location": "Lefkosia (Nicosia) district, Strovolos - Agios Vasileios", "price": "1300.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4148945_3-bedroom-apartment-to-rent/"}, {"date": "Today 15:55", "description": "3 spacious bedrooms with 2 bathrooms and verandas.Only a 5 min walk to all the coffee shops and restaurants in the busy area of the city center. Close to all shops and amenities (schools, banks, post office) and within walking distance from Tennis, Parks, Swimming pool and all the commercial streets of Nicosia.-Big sitting areas with parquet floor, dining room opening to a nice covered veranda with bbq area. -Modern kitchens with all electrical appliances.-Central heating, full a/c for hot and cold, solar panels, pressure system and covered parking, Storage room.", "id": "4160692", "location": "Lefkosia (Nicosia) district, Egkomi", "price": "1000.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160692_3-bedroom-apartment-to-rent/"}, {"date": "Today 15:47", "description": "Luxury duplex penthouse apartment available for rent in Lykabittos, Nicosia! The building is located in a cul-de-sac close to the Landmark hotel and it enjoys an unobstructed view of the city! - 3 bedrooms (one is en-suite)- 2 bathrooms- Fully equipped kitchen- Fireplace- Central Heating- Air condition units- Alarm system- Double Glazing Windows- Covered veranda- Uncovered Veranda- BBQ- 2 covered parking spaces *A separate en-suite room is also included in the price of rent*-Πολυτελές διώροφο ρετιρέ διαμέρισμα διαθέσιμο προς ενοικίαση στον Λυκαβηττό, Λευκωσία! Το διαμέρισμα βρίσκεται σε μια από τις πιο κεντρικές τοποθεσίες της πρωτεύουσας, σε μια ήσυχη γειτονιά κοντά στο ξενοδοχείο Landmark και διαθέτει μια υπέροχη πανοραμική θέα της Λευκωσίας! - 3 Υπνοδωμάτια (master bedroom en-suite)- 2 Μπάνια- Πλήρως εξοπλισμένη κουζίνα- Τζάκι- Κεντρική θέρμανση- Καλυμμένη βεράντα- Ακάλυπτη βεράντα- Σύστημα συναγερμού- Διπλά τζάμια- BBQ- 2 καλυμμένες θέσεις στάθμευσης * Ένα ξεχωριστό δωμάτιο με ιδιωτικό μπάνιο περιλαμβάνεται επίσης στην τιμή του ενοικίου *", "id": "3957146", "location": "Lefkosia (Nicosia) district, Nicosia - Lykabittos", "price": "1700.00", "title": "4-bedroom penthouse to rent", "url": "www.bazaraki.com/adv/3957146_4-bedroom-penthouse-to-rent/"}, {"date": "Today 15:46", "description": "Εξαιρετικό επιπλωμένο ρετιρέ διαμέρισμα τριών υπνοδωματίων με μεγάλη καλυμμένη βεράντα διαθέσιμο προς ενοικίαση στην Έγκωμη, Λευκωσία! Το διαμέρισμα βρίσκεται στον τρίτο όροφο πολυκατοικίας υψηλών προδιαγραφών.- Πλήρως επιπλωμένο- 3 Υπνοδωμάτια - 2 Μπάνια και 1 Αποχωρητήριο Ξένων- Μεγάλο και φωτεινό σαλονι- Τζάκι- Πλήρως εξοπλισμένη κουζίνα- Μεγάλη καλυμμένη βεράντα- Ακάλυπτη βεράντα- Κλιματιστικά σε όλα τα δωμάτια- Καλυμμένος χώρος στάθμευσηςΕμβαδόν περιτοιχισμένου χώρου: 100τμΕμβαδόν καλυμμένων βεραντών: 50τμΣύνολο Καλυμμένων χώρων: 150τμΑκάλυπτη βεράντα: 30τμ-Excellent furnished top floor three bedroom apartment with a large covered veranda available for rent in Engomi, Nicosia! The apartment is located on the third floor of a high quality apartment building!- Fully furnished- 3 Bedrooms- 2 Bathrooms and 1 Guest WC- Large and bright living room- Fireplace- Fully equipped kitchen- Large covered veranda- Uncovered veranda- Air condition units in all rooms- Covered parkingCovered Internal Area: 100m²Covered Veranda: 50m²Total Covered Area: 150m²Uncovered veranda: 30m²", "id": "3951196", "location": "Lefkosia (Nicosia) district, Egkomi", "price": "1500.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/3951196_3-bedroom-apartment-to-rent/"}, {"date": "Today 15:45", "description": "Spacious fully furnished three bedroom upper house available for rent in a prime location of Strovolos, Nicosia, off Prodromou street, close to the post office!- 3 Bedrooms (master bedroom is en-suite)- 2 Bathrooms- 1 Guest WC- Large living room and dining room- Sitting room- Separate fully fitted kitchen- Covered veranda- Air condition units- Central Heating- Covered parkingCovered Internal Area: 280m²Covered Veranda: 26m²Total Covered Area: 306m²", "id": "4000004", "location": "Lefkosia (Nicosia) district, Strovolos - Chryseleousa", "price": "1500.00", "title": "3-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/4000004_3-bedroom-semi-detached-to-rent/"}, {"date": "Today 15:20", "description": "Brand new 1 bedroom apartments located in Egkomi within walking distance from UNIC MEDICAL SCHOOL. All the apartments will include the basic equipment, (electric stove, oven, extractor fan, refrigerator, washing machine, air conditioning split units and blinds). Starting prices from 1st floor Price for appliances only 600 euro. Price for fully furnished 700 euro. 2 years contract required Prices non negotiable. Real estate agency R.N. 1097 L.N. 310/E", "id": "4131010", "location": "Lefkosia (Nicosia) district, Egkomi", "price": "600.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4131010_1-bedroom-apartment-to-rent/"}, {"date": "Today 15:02", "description": "Apartments for rent in one of the most iconic projects in Nicosia, in a famous skyscraper with a magnificent view of the urban agglomeration and a significant part of Cyprus (from the Troodos Mountains to the Kyrenia mountains).Apartment Features:Modern VRV air conditioners, as well as a heating system (including \"underfloor heating\")Ventilation systemHigh-quality furniture made of corian/technograniteHigh quality marble/parquet floorsLuxury plumbing with frameless glassEnergy efficiency class: AProject Characteristics:On the 10th floor of the complex (Relax / Enjoy zone) there are: a two-tier swimming pool with a sun terrace, a fully equipped gym, a wellness center with sauna and steam bath, as well as a Club for residentsRestaurants and clubs are located on the 33rd and 34th floorsServices: 24-hour concierge and cleaning services", "id": "4112710", "location": "Lefkosia (Nicosia) district, Nicosia - Ag. Antonios", "price": "1700.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4112710_2-bedroom-apartment-to-rent/"}, {"date": "Today 14:53", "description": "A cosy 2-bedroom apartment with a pool, bbq area and literally steps to the beach. It’s located by the Eucalyptus beach path with clean beaches, cafes and restaurants. The apartment itself includes all you need: a fully equipped kitchen, towels and bed sheets, a big TV", "id": "4160616", "location": "Limassol district, Limassol - Agios Antonios", "price": "3000.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160616_2-bedroom-apartment-to-rent/"}, {"date": "Today 14:52", "description": "connected maisonette on three floors, 2 bedrooms + extra room downstairs, bathroom and guest toilet, separate kitchen, living room with veranda, fully furnished within walking distance from the sea", "id": "4160599", "location": "Limassol district, Germasogeia Tourist Area", "price": "1800.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4160599_3-bedroom-detached-house-to-rent/"}, {"date": "Today 14:52", "description": "Lovely one bedroom apartment is available now in Pareklisia in Limassol.It has internal covered area 50 square meters and covered verandas 20 square meters.There is an open plan kitchen with one sitting room, one bedroom and a family bathroom.This beautiful apartment has a/c in all areas and one uncovered parking spaceIt is located in a quiet residential area close to all main amenities with an easy access to down town and the motor way.It has quick access to all needed amenities including supermarkets, parks,schools, pharmacies, and restaurants.", "id": "4143092", "location": "Limassol district, Parekklisia", "price": "750.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4143092_1-bedroom-apartment-to-rent/"}, {"date": "Today 14:43", "description": "Three bedroom upper floor house in Kato Polemidia area one of the most beautiful areas in Limassol.It has internal area 280 square meters and 20 square meters veranda .It consists from a separate kitchen, an utility room,a living room/dining room, guest w.c. and a family bathroom.Furthermore there are three bedrooms (one of them en suite) with spacious cabinets .The house was built of excellent and durable materials in classic/modern architectural design and features comfortable and functional spaces.It has solar water heater with pressure, fire place and inverted a/c in all rooms.This upper floor house has a lift as well.It is located in a quiet residential area close to all main amenities with an easy access to down town and the motor way.It has quick access to all needed amenities including supermarkets, parks,schools and restaurants.", "id": "4158917", "location": "Limassol district, Polemidia Kato", "price": "1400.00", "title": "3-bedroom town house to rent", "url": "www.bazaraki.com/adv/4158917_3-bedroom-town-house-to-rent/"}, {"date": "Today 14:43", "description": "Three bedroom detached house in Mesa Gitonia area is available now.It has internal covered area 160 square meters and the plot size is 375 square meters.There is a separate kitchen with one living room,one sitting room, one dining room and a guest w/c.It is not furnished .Also there are three bedrooms sharing a family bathroom.It has solar water heater with pressure, a/c in all rooms and covered parking for one car.Located in a quiet,nice area surrounded by nice houses.It has quick access to all needed amenities including supermarkets, parks,schools and restaurants.", "id": "4158918", "location": "Limassol district, Limassol - Mesa Geitonia", "price": "1600.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4158918_3-bedroom-detached-house-to-rent/"}, {"date": "Today 14:42", "description": "One Bedroom Apartement of a small buildig.Building is of high quality and excellent condition.Is located in a prime area surrounded by all amenities and facilities .Mikel cafe and where Aglantzia avenue meet with Larnaca avenue at the roundabout are only 30 meters of distance.No Agents", "id": "3948238", "location": "Lefkosia (Nicosia) district, Aglantzia", "price": "490.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/3948238_1-bedroom-apartment-to-rent/"}, {"date": "Today 14:33", "description": "Monari diamerisma se isogio xoris kinoxrista.", "id": "4160573", "location": "Lefkosia (Nicosia) district, Nicosia - Panagia", "price": "450.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160573_1-bedroom-apartment-to-rent/"}, {"date": "Today 13:18", "description": "Προς Ενοικίαση Διαμέρισμα, Στρόβολος, Ακροπολη, 120 τ.μ., 1 Επίπεδο/α, 1ος Όροφος, 3 Υ/Δ, 1 Μπάνιο/α, 2 WC, 1 Κουζίνα/ες, Δάπεδα: πλακακια παρκε, Kουφώματα: Αλουμινίου, 1 parking, Έτος κατασκευής: 2007, Κατάσταση: Καταπληκτική, Ενεργειακό Πιστοποιητικό: Υπό έκδοση, Χαρακτηριστικά: Ασανσέρ, Αποθήκη, Ηλ. Συσκευές, Διπλά Τζάμια, Βεράντες, Πολυτελές, Διαμπερές, Προσόψεως, Φωτεινό, Κλιματισμός, Ηλιακός, Boiler, Βαμμένο, Κεντρική - Πετρέλαιο Θέρμανση, Θέα: Καλή, Τιμή: 800€..OMEGA REAL ESTATE CYPRUS LTD AM 1097 AA310/E ID1220344", "id": "3767818", "location": "Lefkosia (Nicosia) district, Strovolos - Acropolis", "price": "800.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/3767818_3-bedroom-apartment-to-rent/"}, {"date": "Today 13:18", "description": "Ενοικιάζεται μονάρι μόνο με ηλεκτρικές συσκευές στήν Αγλατζιά κατοικίδια μή σποδεκτά μεσίτες αποκλείονται Διαθέσιμο άμεσα", "id": "4110255", "location": "Lefkosia (Nicosia) district, Aglantzia", "price": "475.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4110255_1-bedroom-apartment-to-rent/"}, {"date": "Today 12:46", "description": "Two bedroom apartment for rent in Tala Vilage / Stephanie Gardens .Fully Furnished.No petsOnly for persons with proven income", "id": "4160435", "location": "Paphos district, Tala", "price": "900.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160435_2-bedroom-apartment-to-rent/"}, {"date": "Today 12:40", "description": "Exclusive and fully renovated one bedroom apartment available for rent located in Pareklisia just 10minutes from the beach, situated on a luxury small building, equipped with all electrical installations and appliance including all kitchen appliance, air condition units in all areas, secret light fixtures, a bathroom, open living and dining room area, covered balcony and an assigned private parking, offered unfurnished and a no pets requirement. For additional information or to arrange a viewing please contact us.*OWNER IS ASKING FOR 1 RENT AND 2 DEPOSITS*Price: €750Ref: R-FL1-683", "id": "4160447", "location": "Limassol district, Parekklisia", "price": "750.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160447_1-bedroom-apartment-to-rent/"}, {"date": "Today 12:25", "description": "The apartment is located in the prestigious area of Universal 500m from the beachfront. One of the most popular locations of the city.The apartment is of the highest quality properties on the marketing featuring:-Smart home system-Outdoor heated pool-Covered parking space-Fully airconditioned (VRV)-Fully serviced and fully equiped-Fast wifi internet-Full kitchen equipment, white goods, bed premium bedlinensIt can be rented for periods ranging between 1 - 12 months or more.The apartment features 3 bedroom, 2 bathroom, bed linen, towels, a flat-screen TV, a dining area, a fully equipped kitchen, and a balcony with sea and city viewsThe apartment is ideal for business executives, digital nomads or busy people as there is everything included. Its ready to move in!", "id": "4132403", "location": "Paphos district, Paphos - Universal", "price": "2300.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4132403_3-bedroom-apartment-to-rent/"}, {"date": "Today 12:22", "description": "2 bedroom apartment for sale, Agios Tychonas tourist area, Limassol opposite the best beach in Limassol and Four Seasons hotel. It’s just a minute from all everyday amenities and public transportation. This flat is on the 4th and top floor with another 2 luxurious flats on the floor in a well maintained building with recently decorated entrance and hallways. The whole floor was also renovated. The flat is within complex which has private parking place for this flat but also much more open parking spaces for guests or an extra car of the owner. It offers also a communal swimming pool with shower, trees and park behind. The apartment consists of a living room with open plan kitchen, two bedrooms and one bathroom. It is furnished and has also three a/c units. The flat has a spacious veranda which offers a stunning view of the Mediterranean sea. It has also covered parking space on title deed and is ready to be transferred any time to the new buyer. Rare investment by the area, position and beautiful views!• Property covered area: 76m² internal and 12m2 verandas► Distance to the sea: 100m► Communal Swimming Pool► Title Deed► Lovely Sea View► 4th floor (top)► 1 bathroom► Covered parking► Elevator► Amenities on your doorstep", "id": "4160405", "location": "Limassol district, Agios Tychon Tourist Area", "price": "1500.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160405_2-bedroom-apartment-to-rent/"}, {"date": "Today 12:13", "description": "Charming Three Bedroom house for Rent in Oroklini village, Larnaca. Just 2,5km from the beach, 5-star hotels, restaurants etc. Part of an exclusive project with a private road. The village of Oroklini provides all amenities and is just a 10 minuted drive to Larnaca town.House for sale in Oroklini area, Larnaca. The property consists of three bedrooms, an open plan kitchen, living and dining area, one bath, one bath en-suite, one shower, 3wc, private pool, garden, storage room, A/C in the bedrooms, Internet and Satellite connection.Extra: A/C, Swimming pool, Garden, Storage Room, Fully Furnished, Electrical Appliances.&nbsp;", "id": "4160369", "location": "Larnaca district, Oroklini", "price": "1500.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4160369_3-bedroom-detached-house-to-rent/"}, {"date": "Today 12:10", "description": "Fully loaded 2 bedroom apartment Wooden floors through out with high quality finishesThe apartment has modern furniture and all electrical appliances are included a must see", "id": "3889268", "location": "Lefkosia (Nicosia) district, Egkomi", "price": "1400.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/3889268_2-bedroom-apartment-to-rent/"}, {"date": "Today 12:10", "description": "A very modern apartment on the 7th floor with an amazing view of Nicosia. Just 5 minutes from Makariou street on foot. Very stylish with all the amenities, a/c in all rooms, electrical appliances, cooking cutlery, dishes & glasses. Has 3 small balconies and a small storeroom.Available from beginning of April.Πολύ ωραίο και μοντέρνο διαμέρισμα στον 7ο όροφο με θέα την Λευκωσία. Μόνο 5 λεπτά περπάτημα απο Μακαρίου.Περιέχει a/c σε όλα τα δωμάτια, όλες τις ηλεκτρικές συσκευές, ποτήρια, πιάτα και ότι χριάζεται μια κουζίνα. Με 3 μικρά μπαλκόνια και μια αποθήκη.", "id": "4017878", "location": "Lefkosia (Nicosia) district, Nicosia - Ag. Antonios", "price": "850.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4017878_2-bedroom-apartment-to-rent/"}, {"date": "Today 12:06", "description": "1 bedroomed second floor apartment with communal swimming pool, roof terrace and allocated covered parking in Dherynia.Set on a well maintained block of apartments in a quiet residential area, this one bedroomed property is located on the second floor with both lift and staircase access.The apartment entrance leads to the open plan kitchen, dining and living room with patio door access to the balcony. The balcony has stunning views of the surrounding countryside and the Famagusta coastline. The larger than average double bedroom has fitted wardrobes and the apartment has air conditioning throughout. The large bathroom has a bath with shower, sink and wcThe apartment is available from the end of April 2022 with a rent of 425 euros per calendar month on a furnished basisProperty Features:available end of April 20221 bedroomedcommunal swimming poolallocated covered parking spacecommunal roof terrace with amazing sea viewsfurnishedBalcony1st floor apartmentelevator", "id": "4120058", "location": "Famagusta district, Deryneia", "price": "425.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4120058_1-bedroom-apartment-to-rent/"}, {"date": "Today 12:04", "description": "A comfortable two bedroom apartment in a quiet area. Fully furnished with three balconies.A very good choice for a family.", "id": "4144076", "location": "Lefkosia (Nicosia) district, Agios Dometios - Agios Georgios", "price": "850.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4144076_2-bedroom-apartment-to-rent/"}, {"date": "Today 12:01", "description": "Located in the centre of Larnaca town, two bedroom apartment, fully furnished with all electrical appliances. Walking distance to all facilities and appr 700meters from Finikoudes promenade.Year build 2009Cover area 70sqm, Veranda 23m2Rent price €740", "id": "4160358", "location": "Larnaca district, Larnaka - Skala", "price": "740.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160358_2-bedroom-apartment-to-rent/"}, {"date": "Today 12:01", "description": "An exclusive modern and spacious villa located in a quiet location in Protaras. The plot size is a huge 1600 square meters and the covered area including the garage is an impressive 300 square meters.When you enter the villa you will see the modern open space living room with comfortable sofas, the LCD tv mounted on the wall and a fireplace which is perfect for the cold winter months. On the side is the kitchen with the cooker in the middle, a large fridge, cupboards and sink. There are 4 bedrooms upstairs and one bedroom downstairs, a very well equipped modern kitchen as well as a second smaller kitchen and a large living space with a pool table. The villa is also equipped with a 5Kwh solar panels system.The garden and patio can be accessed from the kitchen and also from the living area. There is also an entrance to the garage from the kitchen. On the ground floor next to the stairs there is the guest W.C. Past the living room there is a bedroom with 2 single beds.Upstairs there is a fridge and laundry space with a clothes dryer and washing machine.On the left side of the corridor there are 2 bedrooms one with ensuite bathrooms and between them there is a large family bathroom with a bath and a toilet. On the right side of the corridor there are another two bedrooms. The first one is designed for children. The second one has a glass door that connects to the terrace with amazing sea views.The corridor leads to a terrace with patio furniture and those fantastic sea views; perfect for relaxing in the evening with a nice bottle of wine and candle light.", "id": "4114497", "location": "Famagusta district, Protaras", "price": "3000.00", "title": "5-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4114497_5-bedroom-detached-house-to-rent/"}, {"date": "Today 11:58", "description": "ΜΟΝΟ ΓΙΑ ΣΤΡΑΤΙΩΤΙΚΟΥΣ ΑΠΟ ΕΛΛΑΔΑ-ΘΑ ΕΙΝΑΙ ΔΙΑΘΕΣΙΜΟ ΑΠΟ 11/07/2022Διαμέρισμα σε κεντρική τοποθεσία στην Λάρνακα στον 2ο όροφο 2 υπνοδωματίων, μπορεί να φιλοξενήσει 4 άτομα. Περιλαμβάνει το καθιστικό με ανοιχτή κουζίνα, 2 υπνοδωμάτια με 1 διπλό και 2 μονά κρεβάτια αντίστοιχα, λουτρό με μπανιέρα και 2 βεράντες, μια σε καλυμμένο χώρο και η άλλη βεράντα με απρόσκοπτη θέα σε πράσινο. Εξοπλισμός: Κλιματιστικά σε όλους τους χώρους, 2 τηλεοράσεις, 1 ψυγείο, ηλ. κουζίνα με 4 εστίες και φούρνο, πλυντήριο, πλήρης εξοπλισμός εστίασης, καθιστικό 2 καναπέδες με τραπεζάκι, στεγασμένος χώρος στάθμευσης των αυτοκινήτου.Τοποθεσία: Η διεύθυνση είναι Πηνελόπης 4, ταχυδρομικός κώδικας 6057, διαμέρισμα 202, Λάρνακα. Στην περιοχή υπάρχουν πολλά σουπερμάρκετ, σχολεία για όλες τις βαθμίδες, γυμναστήρια, το κέντρο εξυπηρέτησης του πολίτη, εστιατόρια και πολλά άλλα καταστήματα. Επίσης στην περιοχή μένουν πολλοί στρατιωτικοί από Ελλάδα.", "id": "4160347", "location": "Larnaca district, Larnaka - Sotiros", "price": "600.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160347_2-bedroom-apartment-to-rent/"}, {"date": "Today 11:57", "description": "Ενοικιάζεται Ρετιρέ Διαμέρισμα 3 υπνοδωματίων Περιοχή : Ακρόπολη 🌳🌳🌳Κοντά στο πάρκο - Ακρόπολης ! ▪️Άμεσα διαθέσιμο 🔘Το διαμέρισμα βρίσκεται σε άριστη κατάσταση και σε εξαιρετική περιοχή . 🔘Είναι πολύ ευρύχωρο με άνετους χώρους υποδοχής . 150 m² 🔘Βρίσκεται στον τρίτο όροφο μιας τριώροφη πολυκατοικίας 🔘Πρόσφατα ανακαινισμένο 🔘 Πολλούς αποθηκευτικούς χώρους 🔘 Πλήρως επιπλωμένο 🔘 Τηλεόραση TV 🔘 Δύο αποχωρητήρια με δύο μπάνια 🔘 Κεντρική θέρμανση 🔘Με όλες τις ηλεκτρικές συσκευές 🔘Πλυντήριο πιάτων 🔘 Πλυντήριο ρούχων 🔘 Στεγνωτήριο ρούχων 🔘Μπαλκόνι 🔘Καλυμμένος χώρο στάθμευσης 🔘Κλιματιστικά σε όλους τους χώρους 🔘Ανελκυστήρας διαθέσιμος 🔘Πόρτα ασφαλείας 🐕‍🦺 Κατοικίδια δεν είναι αποδεκτά . 💶 Τιμή: €1300 + Κοινόχρηστα ΓΙΑ ΠΛΗΡΟΦΟΡΙΕΣ ΚΑΙ ΔΙΕΥΘΕΤΗΣΗ ΡΑΝΤΕΒΟΥ ΚΑΛΕΣΤΕ ΣΤΟ: (ΦΙΛΙΠΠΟΣ)☎️📞📞📞 PH-121 Agency ( Reg-Lic No:797-120/)", "id": "4160346", "location": "Lefkosia (Nicosia) district, Strovolos - Acropolis", "price": "1300.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160346_3-bedroom-apartment-to-rent/"}, {"date": "Today 11:55", "description": "3 bedroom house with 2 toilet, 1 bathroom, underground parking and garden.", "id": "4160332", "location": "Larnaca district, Larnaka - Kamares", "price": "750.00", "title": "3-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/4160332_3-bedroom-semi-detached-to-rent/"}, {"date": "Today 11:45", "description": "Large and Central This large and perfect 3 BEDROOM GROUND FLOOR FLAT has the best location in larnaca. With all services and amenities at your door: -7min walk to Finikoudis beach and town - Next door to bank of Cyprus and chemist. -Down the street 4min walk to METRO supermarket. -5min drive -15min walk to Metropolis Mall - Bus stop right out front of the flat. - Fully air conditioned and central heating - Furniture included. - 2 BATHROOMS - perfect and clean Flat building - Private and Secure Flat - 1 CAR COVERED CAR SPOT", "id": "4160326", "location": "Larnaca district, Larnaka - Sotiros", "price": "750.00", "title": "3-bedroom ground floor apartment to rent", "url": "www.bazaraki.com/adv/4160326_3-bedroom-ground-floor-apartment-to-rent/"}, {"date": "Today 11:33", "description": "This detached house for rent is located in a very residential area of Oroklini, within close proximity to all amenities, including schools, supermarket, pharmacy, bank, shops, restaurants, and few minutes drive distance to the beach. A short drive to Larnaca Town. Easy access to Larnaca, Ayia Napa, Nicosia motorway.The house has an open plan living area with kitchen and dining space, a toilet for the guests, four bedrooms, and a main family bathroom with a toilet. Fully furnished house with all electrical appliances and fitted wardrobes in all bedrooms.", "id": "4112479", "location": "Larnaca district, Oroklini", "price": "3000.00", "title": "4-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4112479_4-bedroom-detached-house-to-rent/"}, {"date": "Today 11:29", "description": "2 bedroom ground floor Beach Flat, fully furnished, located in the beautiful tourist area of Oroklini, Larnaca. The flat comes with a private parking space, private garden, air-condition split system, as well as a modern open plan kitchen with all electrical appliances included and an open plan living and dining room area.The ideal location has walking distance to the beach and luxury resorts and it is surrounded by a various amenities such as beach bars, restaurants, cozy cafeterias and mini markets which can also be accessed by foot.There is incredibly easy access to the main roads and even the highway which can offer convenience to the tenants.NO PETS ARE ALLOWED PRICE DOES NOT INCLUDES COMMON EXPENSES OF 50 EUROS PER MONTH * Beach Gound floor flat (50m from the beautiful blue flag Oroklini beach)*Tourist area with fancy restaurants/ bars ets.*New bathroom, new shower and new accessories*Fully furnished with new furniture’s.*New Air conditioning units in all rooms* Open plan living area*Private Parking space and private garden area.* Near the 5stars Radisson Beach Resort Larnaca", "id": "4160301", "location": "Larnaca district, Oroklini Tourist Area", "price": "680.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160301_2-bedroom-apartment-to-rent/"}, {"date": "Today 11:21", "description": "The residential complex is located in a quiet area of Neapolis, only 400 meters to the seafront, and close to all amenities: boutiques, shops, cafes, and restaurants with oriental, European, Russian, and eastern cuisine.The four-storey building to the original configuration designed in Mediterranean style catches the eye with a snow-white facade with decorative elements. There are only six apartments – of one, two, and three bedrooms.The apartment is fully furnished, with interior decoration, household appliances, and sanitary ware from leading European manufacturers. Air conditioning, double-glazed windows with reinforced soundproofing, high ceilings with recessed lighting, and led lighting.The apartment is situated on the 2nd floor, it consists of an open plan kitchen/sitting/dining area, master bedroom en-suite, two bedrooms sharing a family bathroom, guest WC, and laundry room.Covered internal area: 90 sq.m.Covered veranda: 30 sq.m.Storage room: 4 sq.m.Price: 2,500/per month (+ 2 Deposits are required)*Pets are not allowedI.C. 64736", "id": "4160306", "location": "Limassol district, Limassol - Neapolis", "price": "2500.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160306_2-bedroom-apartment-to-rent/"}, {"date": "Today 11:04", "description": "Ισόγειο διαμέρισμα 90m2 με 27m2 αυλη, σε διώροφο, σύγχρονο, συγκρότημα κατοικιών με πισίνα, υπόγειο πάρκινγκ και αποθήκη. Βρίσκεται σε ήσυχο αδιέξοδο και όμορφο δρόμο στη Λακατάμια. Υπάρχει και δεύτερο διαμέρισμα ακριβώς δίπλα, με τα ίδια χαρακτηριστικά και 50m2 αυλή.", "id": "4143560", "location": "Lefkosia (Nicosia) district, Lakatameia - Anthoupolis", "price": "700.00", "title": "2-bedroom ground floor apartment to rent", "url": "www.bazaraki.com/adv/4143560_2-bedroom-ground-floor-apartment-to-rent/"}, {"date": "Today 10:31", "description": "For rent TWO BEDROOM APARTMENT CITY CENTER LARNACA 060522S15 @EUR 1500 MONTHLY • 2 bedroom flat • Spacious • Internal area: 100 m2 • On the 2nd floor C.K.C.M. PROPERTY ONE REAL ESTATE LTD RN1026 LN510E", "id": "4160254", "location": "Larnaca district, Larnaka - Agios Nikolaos", "price": "1500.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160254_2-bedroom-apartment-to-rent/"}, {"date": "Today 10:15", "description": "One-of-a-kind, luxurious whole floor Penthouse with roof garden located at the border of Strovolos-Engomi in a 6-year-old modern building. Very large modern kitchen with separate laundry room, family room, large dining room, and double main lounge with two-sided wood fireplace. 3 large bedrooms all en suite (main with Jacuzzi) plus guest toilet plus maid's quarters (with bathroom and kitchenette). All bedroom windows with electric shutters. Fully A/C and underfloor C/H, alarm, wifi, and sound system throughout, Infinity swimming pool covered with sliding glass roof with solid wood decking on main floor plus roof garden with BBQ area. All electrical appliances and curtains included. 2 covered garages plus large storeroom. Large covered verandhas. AC, CH, deck, and pool maintenance are included in the rental. Total covered areas over 350m2.", "id": "4160225", "location": "Lefkosia (Nicosia) district, Egkomi", "price": "3000.00", "title": "4-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160225_4-bedroom-apartment-to-rent/"}, {"date": "Today 10:10", "description": "3 bedroom detached house in agia Fyla, 3 living areas, en-suite to master bedroom, utility room, separate kitchen, storage room, covered parking.", "id": "4160219", "location": "Limassol district, Limassol - Agia Fyla", "price": "2500.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4160219_3-bedroom-detached-house-to-rent/"}, {"date": "Today 10:00", "description": "3 bedroom apartment in germasogeia tourist area, 20 meters from the sea. Separate kitchen, 2 bathrooms, sea views, fully furnished.", "id": "4160212", "location": "Limassol district, Germasogeia Tourist Area", "price": "1500.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160212_3-bedroom-apartment-to-rent/"}, {"date": "Today 09:58", "description": "Newly renovated Independent 4 bedroom house in Egkomi. Fully Aircontition, Central heater, Covered parking, very spacious house with balconies and verandas. New fridge and washing machine. Very nice and quite area ideal for families, next to nice park and school.", "id": "4160198", "location": "Lefkosia (Nicosia) district, Egkomi - Makedonitissa", "price": "1250.00", "title": "4-bedroom town house to rent", "url": "www.bazaraki.com/adv/4160198_4-bedroom-town-house-to-rent/"}, {"date": "Today 09:45", "description": "FOR RENT TWO BEDROOM APARTMENT MAKENZY 060522S13 @EUR 1500 MONTHLY • 2 bedrooms • 2 bathrooms • Fully furnished • Site sea view C.K.C.M. PROPERTY ONE REAL ESTATE LTD RN1026 LN510E", "id": "4160182", "location": "Larnaca district, Larnaka - Agios Nikolaos", "price": "1500.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160182_2-bedroom-apartment-to-rent/"}, {"date": "Today 09:44", "description": "Ενοικιάζεται διαμέρισμαΔύο υπνοδωματίωνΕπιπλωμένοΣε άριστη κατάστασηΠεριοχή La -Stampa", "id": "4160180", "location": "Larnaca district, Larnaka - Tsakilero", "price": "600.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160180_2-bedroom-apartment-to-rent/"}, {"date": "Today 09:32", "description": "FOR RENT TWO BEDROOM APARTMENT MAKARIOU AV., LARNACA 060522S12 @EUR 1000 MONTHLY • 2 bedrooms • 2 bathrooms • Brand new C.K.C.M. PROPERTY ONE REAL ESTATE LTD RN1026 LN510E", "id": "4160169", "location": "Larnaca district, Larnaka - Agios Nikolaos", "price": "1000.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160169_2-bedroom-apartment-to-rent/"}, {"date": "Today 09:30", "description": "1 bedroom ground floor house including free internet and fully furnished in Apostolos Andreas area. The house is near many amenities pharmacies, shops, kiosk, etc. Quiet neighborhood with easy access to both highway and seaside. Fully furnished, including home appliances, air condition only in the living room, however can also cover the bedroom if the door remain open. To be rent only to 1 person, not a couple.", "id": "4160158", "location": "Limassol district, Limassol - Apostolos Andreas", "price": "800.00", "title": "1-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/4160158_1-bedroom-semi-detached-to-rent/"}, {"date": "Today 09:27", "description": "-3 bed Fully nicely furnished 180 sq.m Renovated Penthouse apartment located off Kennedy and Nikis avenue near a playground walking distance to all amenities.-Big sitting areas with parquet floor,2 settees and dining room opening to a nice covered veranda with bbq area.-Separate fully equipped kitchen with veranda + office space area next to kitchen.-3 spacious bedrooms with 2 bathrooms and verandas.-Storage heaters, full a/c for hot and cold( can be replaced with new ones) solar panels, pressure system and covered parking.-Suitable for a couple or small family.-Approximate location on the map.-For more details contact as on Chat in Bazaraki.", "id": "4160159", "location": "Lefkosia (Nicosia) district, Agioi Omologites", "price": "1200.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160159_3-bedroom-apartment-to-rent/"}, {"date": "Today 09:25", "description": "3 bedroom detached house in Agia Fyla, fully furnished. Spacious living room with fireplace, en-suite to master bedroom, guest wc, covered parking, storage room, garden with swimming pool.Easy access to highway.", "id": "4160163", "location": "Limassol district, Limassol - Agia Fyla", "price": "3000.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4160163_3-bedroom-detached-house-to-rent/"}, {"date": "Today 09:06", "description": "στούντιο στο Λυκαβηττό πλήρως επιπλωμένο Με ίντερνετ κοινόχρηστα σκύβαλα συμπεριλαμβανόμενα στην τιμή μεσίτες αποκλείονται το διαμέρισμα το νοικιάζουμε και για πιο μικρό χρονικό διάστημα", "id": "4158915", "location": "Lefkosia (Nicosia) district, Nicosia - Ag. Antonios", "price": "420.00", "title": "Studio apartment to rent", "url": "www.bazaraki.com/adv/4158915_studio-apartment-to-rent/"}, {"date": "Today 08:58", "description": "Luxury whole floor apartment for rent located in near proximity of one of the most popular areas of Strovolos. Close to all amentinies such as Banks, Retails, Schools, Supermarkets, Bakeries, etc. This 2 bedroom flat is on the 5th floor of a 5-storey building. The building consists only of 5 apartments, one on each floor.What stands out is that is is very spacious and bright with natural light.Upon exiting the elevator you will find a spacious pre hall with two entrances one being the main into the living room and the other one leading to the rest of the apartment. When walking into the apartment one will find the corridor and a few steps to the left you will find your self in the spacious living room. The living room has one very large veranda on the side and a balcony on the front, the guest W.C is also included in the living room.The kitchen is large and separated from the living room.It is fully equipped with almost new appliances: an oven, electric hob and a fridge. It also has enough space to place a family table for simple day to day family dinners and lunches. In addition it features a small balcony that is also connected to one of the bedrooms. On the right side of the corridor you find the two bedrooms with fitted closets and parquet floors. The family bathroom is situated right across from the bedrooms. At the end of corridor there is a glass door leading to a private massive veranda with a build in BBQ .Two out of the four Aircondition units are brand new Wi-Fi connected Bosch separate units.The apartment is offered without furniture.No pets allowed.Price is negotiable under terms.Please call for more information on", "id": "4112369", "location": "Lefkosia (Nicosia) district, Strovolos - Acropolis", "price": "1200.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4112369_2-bedroom-apartment-to-rent/"}, {"date": "Today 08:48", "description": "Ενοικιάζεται διαμέρισμα 1ος υπνοδωματίου σε άριστη κατάσταση, πλήρως επιπλωμένο, με ηλεκτρικες συσκευές, κλιματιστικά και καλυμμένο χώρο στάθμευσης. 60τ.μ + μπαλκόνι. Μικρή και ήσυχη οικοδομη. 1ος οροφος Ενοίκιο 500€+30€ κοινόχρηστα Διαθέσιμο 1η Ιουνίου 2022. Κοντά στο παρκο Ακαδημίας, Λευκωσία. For rent 1 bedroom apartment at perfect condition, fully furnished with electric appliances, air-conditions and covered parking place. 60sqm+balcony. Small and quiet building. Rent 500€+30 common expenses. Available from 1st June 2022. Close to Academia Park, Nicosia.", "id": "4160130", "location": "Lefkosia (Nicosia) district, Nicosia - Ag. Antonios", "price": "530.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160130_1-bedroom-apartment-to-rent/"}, {"date": "Today 08:37", "description": "Beautiful 2 bedroom apartment in Mesa Geitonia. The apartment is located on the first floor and consists of a spacious kitchen with all electrical appliances included, open plan living and dining area leading to beautiful veranda. Futhermore, there are 2 bedrooms with fitted wardrobes, 1 en-suite bathroom with tub and 1 guest toilet with shower. The master bedroom has access to balcony as well.The apartment is fully furnished and fully air-conditioned throughout . 1 covered parking space . All amenities such as kiosks, supermarkets, bakeries and etc are near by . Location : Mesa Geitonia Covered Area : 77m2 Price : € 1200OWNER REQUESTS 2 RENTS UPFRONT AND 1 DEPOSIT . The apartment will be available to move in end of May .", "id": "4129877", "location": "Limassol district, Limassol - Mesa Geitonia", "price": "1200.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4129877_2-bedroom-apartment-to-rent/"}, {"date": "Today 08:34", "description": "Beautiful Detached 4 bedroom villa near Agios Therapos Village Close to Omodos villageThis beautiful villa consists of 3 floorsBasement has gated covered parking with remote control entrance, storage rooms.Ground floor: Big kitchen with all appliances beside us the family room, open plan large living and dining room area opening plus guest toilet all existing to big covered patios, large pool, clay oven with bbq area, storage room.The upper floor : 4 large bedrooms with fitted wardrobes and big balconies master bedroom has ensuite bathroom with shower, plus another big family bathroom with bathtub.Villa is fully furnished with all appliances included air-conditioning throughout the villa, central heating throughout, electrical shutters throughout the villa. AMAZING VIEWS!ONLY 10 MINUTES TO PLATRES AND OMODOS VILLAGE!20 MINUTES TO LIMASSOL Supermarkets and excellent tavernas in the village, schools in the village. All amenities near by Location : Agios TheraposPlot Size :700m2Covered Area : 300m2Price : €3,000 including pool and garden maintenancePET FRIENDLY OWNER REQUESTS 2 SECURITY DEPOSITS AND 6 MONTHS RENTS UPFRONT UFRONTONLY LONG TERM RENTAL MIN 1 YEAR AND OVER", "id": "4114137", "location": "Limassol district, Agios Therapon", "price": "3000.00", "title": "4-bedroom villa to rent", "url": "www.bazaraki.com/adv/4114137_4-bedroom-villa-to-rent/"}, {"date": "Today 08:33", "description": "Large Detached 3 bedroom Villa for rent in Ekali Area.The villa consists of 2 floors.The ground floor has a large kitchen with all electrical appliances open plan living and dining room area with guest toilet all exiting to large verandas and garden area.The upper floor consists of 3 large bedrooms with fitted wardrobes and ensuite bathroom with the master bedroom. Plus a large family bathroom with tub. Plus a small kitchenette to accommodate the bedrooms.The villa is fully furnished, fully air-conditioned, and has central heating throughout the villa. Parque floors in all bedrooms, shutters throughout the villa.Storage room outside, large garden, 4 car uncovered parking, and 1 covered parking.Gated entrance to the villa, gated all around the villa.Villa is 25 years old in very good condition!*Small pets allowedAll amenities nearby, supermarkets, schools, pharmacies, bakeries, restaurants!The motorway is only a few minutes' drive! The beach is a 5-minute drive away!CLOSE TO HERITAGE PRIVATE SCHOOL, PASCAL PRIVATE SCHOOL!AMAZING LOCATION!Location: Ekali - Agia Fila AreaPlot Size: 335m2Covered Area: 280m2Price €3000 per month3 year contract minimum 1 year pre paid rents", "id": "3875316", "location": "Limassol district, Ekali", "price": "3000.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/3875316_3-bedroom-detached-house-to-rent/"}, {"date": "Today 08:32", "description": "Large Detached beautiful 3 bedroom villa with big pool and mature gardens.The villa consists of 2 floors Ground floor consists of a large kitchen with all appliances included large open plan living and dining room area with guest toilet all existing to large patios, big pool, mature beautiful gardens with tree houses and picnic area.Upper floor consists of 3 large bedrooms with fitted wardrobes, master bedroom has ensuite bathroom with shower and balcony, plus a large family bathroom with bathtub.The villa is rented out fully furnished, all appliances included, cental heating and air-conditioning throughout the villa.4 uncovered parkingsGated all around the villa, security cameras, Large patios, verradas around the villa, mature gardens, pool, bbq area.Photovoltaic currently being installed.All amenities supermarkets, schools, kioski, pharmacies, bakeries, parks, banks a 10 minute drive, the motorway is a 15 minute drive, 15 minutes drive to city centre. Only a 5 minute drive to Heritage Private School! Price €3,000 per month including pool and garden maintenance Location : Paramytha Village Plot Size : 1000m2 Covered Area : 230m2 Minimum 1 year rental agreement 2 Security deposits and minimum 4 prepaid rents upfront requested by the owner .", "id": "4140552", "location": "Limassol district, Paramytha", "price": "3000.00", "title": "3-bedroom villa to rent", "url": "www.bazaraki.com/adv/4140552_3-bedroom-villa-to-rent/"}, {"date": "Today 08:30", "description": "Beautiful 3 bedroom semi-detached house available for rent in Omodos village. The house is fully furnished with 3 bedrooms, 1 is with a double bed, and the other 2 bedrooms have 2 single beds in each room.There are 2 full bathrooms with showers and 1 is a guest toilet. The house consists of a natural stone beautiful fireplace as well as electrical and diesel heaters.Outside of the house there is a beautiful big garden with planted trees and a wooden dining table that matches the traditional look of the house. 2 uncovered parking places *It is located in the beautiful mountains, amazing scenery, just a few minute's drive to many nature trails, just 20 minutes from Troodos ski resort, and 40 minutes from the center of Limassol. It is close to all amenities (traditional local restaurants, bakeries, supermarkets)**PETS ARE NOT ALLOWED*Location: OmodosPlot area: 205m2Covered area: 152m2Price: 1,100 euros per month", "id": "3568133", "location": "Limassol district, Omodos", "price": "1100.00", "title": "3-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/3568133_beautiful-3-bedroom-semi-detached-house-in-omodos/"}, {"date": "Today 08:20", "description": "1 bedroom apartment in Paraeklisha for rent.First floor no lift small building. Fully renovated. The apartment consists of a modern kitchen with all appliances included open plan living and dining room exiting to large veranda.1 large bedroom with fitted wardrobes and 1 bathroom with shower.I uncovered parking.Air conditioning throughout the apt. No pets allowed All amenities within a 3 minute walk. The motorway and beach are a 5 minute drive away!Apartment is rented not furnished But can be furnished for a higher priceLocation : Paraeklisha VillageCovered Area : 45m2Covered Veranda : 8m2Price not furnished : €750 per month 2 security deposits and 1 rent upfrontPrice Furnished :€950 6 months upfront rents and 2 security deposits", "id": "4156089", "location": "Limassol district, Parekklisia", "price": "750.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4156089_1-bedroom-apartment-to-rent/"}, {"date": "Today 08:19", "description": "Large brand new 3 bedroom apartment newly furnished apt near Nicosia Mall.Two apartments adjoining into 1 large apartments The apartment consists of 2 large modern kitchens with all electrical appliances, 2 large living and dining room exit to large covered verandas, with 2 guest toilets.2 large bedrooms with fitted wardrobes and 2 large bathrooms with showers both bedrooms have large balconies.Fully air-conditioned throughout the apartment. The apartment is brand new has 2 covered parkings. Small cat allowedAll amenities within a 3 minute walk supermarkets, pharmacies, shops, banks, bus stops, lidol, Nicosia Mall, the Nicosia General Hospital all near by!Close to University of Cyprus Good for students or couples in It!Location : Agalantsia NicosiaCovered Area : 160mwPrice : €2,000 per month including common expenses2 Security deposits and 3 rents upfront minimum 1 year contract", "id": "4156669", "location": "Lefkosia (Nicosia) district, Aglantzia", "price": "2000.00", "title": "3-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4156669_3-bedroom-apartment-to-rent/"}, {"date": "Today 08:18", "description": "Modern renovated 4 bedroom furnished detached villa with roof garden, pool, mature gardens for rent in Agios Tychonas Hills.The villa consists of 3 floorsGround floor consists of a large kitchen including all new appliances with laundry room and guest toilet, open plan living room with fireplace and dining room exiting to large pool and patios, and mature gardens.The upper floor consists of 4 large bedrooms with fitted wardrobes and and 1 family bathroom with jacuzzi bathtub and shower.The roof garden has unobstructed sea views and patios There is a extra separate bedroom with fitted wardrobes and 1 bathroom with shower behind the kitchen with separate entrance. The villa is newly furnished with all new appliances, has electrical wall mounted heaters and fully air-conditioned throughout the villa. 2 covered parkings with remote control gates. In a quiet area where there are all villas and no construction near by. Pets allowed All amenities near by, beach tourist area are a 10 minute drive, the motorway a 10 minute drive away!AMAZING LOCATION!Plot Size : 450m2Covered Area : 260m2Price : €3000 per month including pool and garden maintenance2 Security deposits and minimum 4 months rents requested upfront from the owner Minimum 1 year rental agreement", "id": "4158324", "location": "Limassol district, Agios Tychon", "price": "3000.00", "title": "4-bedroom villa to rent", "url": "www.bazaraki.com/adv/4158324_4-bedroom-villa-to-rent/"}, {"date": "Today 08:17", "description": "Detached renovated 2 bedroom villa with private pool and large patios in Universal Area PaphosThe villa consists of 3 floors Ground floor consists of a separate kitchen with all new appliances including dishwasher and washing machine open plan living and dining room with guest toilet exiting to large patios pool area.The upper floor consists of 2 large bedrooms with fitted wardrobes and balconies master bedrooms balcony over looks the pool. There is a large family bathroom with bathtub.The roof garden has unobstructed sea and city views. Plus a shower plus bbq! There is air-conditioning and ceiling fans throughout the villa There is 1 covered parking space and 1 storage room. The villa is being renovated now!New furniture and new appliances will be installed on the villa!All amenities within a 3 minute walk! The beach is a 10 minute walk away! The motorway is a 2 minute drive away! The villa will be ready to move in June 30,2022 Location : Universal Area Paphos Plot Size : 220m2 Covered Area : 100 m2Price :€2000 Per Month including pool and garden maintenance Minimum 1 year contract 2 security deposits and 4 rents upfront requested by the owner", "id": "4158899", "location": "Paphos district, Paphos - Universal", "price": "2000.00", "title": "2-bedroom villa to rent", "url": "www.bazaraki.com/adv/4158899_2-bedroom-villa-to-rent/"}, {"date": "Today 08:14", "description": "Renovated property in the heart of Limassol. All amenities within walking distance coffee shops, bars, and restaurants.Quite neighbourhood.5 minute walking from the sea front and 15 minute walking from the Limassol Marina.3 Bedrooms2 open space rooms/sitting rooms2 toilets/showersFully equipped kitchenUnfurnishedA/C in all rooms150 sqm45 sqm backyardParking available within 50 mtrs walking distance", "id": "4160089", "location": "Limassol district, Historical Center", "price": "2500.00", "title": "3-bedroom town house to rent", "url": "www.bazaraki.com/adv/4160089_3-bedroom-town-house-to-rent/"}, {"date": "27.04.2022 18:47", "description": "luxury villa 4 bedroom swimming pool plot 260 sqm inside 200 sqm available from 15/06 new villa", "id": "4148514", "location": "Larnaca district, Livadia Larnakas", "price": "2600.00", "title": "4-bedroom villa to rent", "url": "www.bazaraki.com/adv/4148514_4-bedroom-villa-to-rent/"}, {"date": "Yesterday 22:28", "description": "Modern 3 Bedroom sea side house for rent at Kapparis> fully furnished including garden and pool furniture> fully fitted kitchen> fully airconditioned > master bedroom with en-suite bathroom > family bathroom on 1st floor and guest WC at ground floor> private covered parking> private swimming pool> outdoor shower> Bbq and bar at patio area> store room> solar water heating> electric water heating> water pressurizing system> double glazing and blinds throughout> controlled traffic access to road (barrier)> next to park/green area with direct access from back yard.> quiet neighborhood> close to amenities and the beachLong term rental, 1 year minimum.The rent includes:1. Swimming pool cleaning and maintenance2. Gardening Services and garden maintenance", "id": "4160003", "location": "Famagusta district, Kapparis", "price": "1500.00", "title": "3-bedroom villa to rent", "url": "www.bazaraki.com/adv/4160003_3-bedroom-villa-to-rent/"}, {"date": "04.05.2022 21:26", "description": "-2 bed spacious nicely classic expensive furnished apartment near Coca Cola Factory in Agios Dometios .-Big sitting and dining area opening to a nice big covered veranda with green view. -Open plan kitchen with el. appliances and extra veranda.-2 good size bedrooms one with sofa bed and 2nd one with double bed (if needed will be installed from owner ) -Storage heaters, a/c, solar panels, covered parking .-Pets are not allowed .-Owner prefer single or couple.-For more information message on Chat in bazaraki.", "id": "4130928", "location": "Lefkosia (Nicosia) district, Agios Dometios - Agios Pavlos", "price": "600.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4130928_2-bedroom-apartment-to-rent/"}, {"date": "28.04.2022 21:25", "description": "FOR RENT 2 BEDROOM FLAT IN PERVOLIA LARNACARFC 344✔ 75 sqm internal area✔ 2 bedrooms ✔ 1 bathroom✔ 1st floor flat✔ furnished✔ 2010✔ small pets allowed✔ communal fees 30.00✔ availablePRICE: 650.00P.H. S.L.V.A.M. 800 | A.A. 389", "id": "4149978", "location": "Larnaca district, Perivolia Larnakas", "price": "650.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4149978_2-bedroom-apartment-to-rent/"}, {"date": "03.05.2022 13:03", "description": "Luxury 5 bedroom villa for Rent near the seain agios tychon tourist area.The property is rented unfurnished.", "id": "4156286", "location": "Limassol district, Agios Tychon Tourist Area", "price": "2900.00", "title": "5-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4156286_5-bedroom-detached-house-to-rent/"}, {"date": "28.04.2022 20:42", "description": "Νote: RENT INCLUDES COMMON EXPENSES.A 2 bedroom luxury fully furnished apartment with an extra large room for office or sitting room on 1st floor of a well-maintained/secured building near Frederick University. Fully equipped with electrical appliances- electric oven and cooker,microwave, washingdryer machine, refrigerator/freezer, 3 Mitsubishi airconditions( 2x12000 BTU and 1x24000 BTU) 40\"TV, double glazing doors and windows with blinds, safety entrance door locker. A covered parking.The building has a nice garden. PETS and Smoking NOT allowed.", "id": "3987148", "location": "Lefkosia (Nicosia) district, Palouriotissa", "price": "850.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/3987148_2-bedroom-apartment-to-rent/"}, {"date": "27.04.2022 11:58", "description": "This renovated 1-bedroom apartment is centrally located in the heart of Larnaca, behind Saint Lazarus Church where you can explore the rich cultural and historical city, visit the monuments and archeological sites, explore the commercial shops, dine in one of the restaurants and taste traditional Cypriot specialties.The space is fully equipped with everything a guest needs to have a nice and pleasant holiday.Available starting June 10.", "id": "4147382", "location": "Larnaca district, Larnaka - Sotiros", "price": "700.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4147382_1-bedroom-apartment-to-rent/"}, {"date": "03.05.2022 23:07", "description": "Detached Corner Houser FOR RENT 3 bedrooms in the heart of kato paphos Phone number : Paphos district — Kato Paphos Price: €1600 Type: Town house No. of bedrooms: 3 No. of bathrooms: 3 Furnishing: Fully Furnished Parking: Uncovered Air conditioning: Full, all rooms Internet & communal Fees Include in the price Located in the heart of Kato Paphos, walking distance to the beach, bars, restaurants and amenities. Situated on an established project of townhouses and a communal swimming pool. This property corner townhouse has a beautiful green garden surrounding the 3 sides of the property. Front terrace area. Open plan lounge/ dining area/ kitchen, guest WC. Upstairs there are 3 double bedrooms, full bathroom and the master bedroom has a pool facing balcony and its own toilet. Bedrooms: 3 Bedrooms WC: 3 Toilets Includes Internet, smart Tv, nespresso Machine,plates Fridge, dry Machine, laundry, oven, home Cinema Air Conditioning Barbeque Area En suite bathroom Fully furnished Communal swimming pool Open Plan Read Less", "id": "4121254", "location": "Paphos district, Paphos - Kato Paphos", "price": "1600.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4121254_3-bedroom-detached-house-to-rent/"}, {"date": "27.04.2022 17:50", "description": "For Rent 3Bedroom House with Swimming pool and a beautiful landscaped garden, Roof terrace with Sea Views. Its Furnished and equipped having 3 Bedrooms, 2 Bathrooms, toilet downstairs, parking.", "id": "4148404", "location": "Paphos district, Chlorakas", "price": "2450.00", "title": "3-bedroom villa to rent", "url": "www.bazaraki.com/adv/4148404_3-bedroom-villa-to-rent/"}, {"date": "02.05.2022 11:31", "description": "TO LET in a very quiet exclusive residential area near the former “Churchill Hotel” (currently Altius Boutique Hotel), at Ayios Andreas in Nicosia, ONE semi detached ground floor house with spacious reception area consisting of a living room, study and sitting/dinning room. There are three bedrooms, two toilets/bathrooms, a kitchen with all appliances new, three verandas, C/H, A/C devices new and garden around the house with two covered parking places. Total area is 250 sq.m.", "id": "4109946", "location": "Lefkosia (Nicosia) district, Nicosia - Agios Andreas", "price": "1100.00", "title": "3-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/4109946_3-bedroom-semi-detached-to-rent/"}, {"date": "03.05.2022 17:04", "description": "Amazing Villa prime Location Protaras 3 Bedroom 500 Meter from Figtree Bay (Anemoni Prestige Project )", "id": "4101702", "location": "Famagusta district, Protaras", "price": "2500.00", "title": "3-bedroom villa to rent", "url": "www.bazaraki.com/adv/4101702_3-bedroom-villa-to-rent/"}, {"date": "Yesterday 11:36", "description": "Just bring your suitcase and start living! A thoughtfully furnished, fully equipped bright 2 bedroom apartment with tons of natural light located in the neapolis area in Limassol is ready to welcome you.A fully renovated apartment, with cozy interior designs and stylish modern furniture, luxury linen and towels in a peaceful neighborhood is waiting for you to join. The Staycaee ’s luxury outdoor furniture will allow you to relax and enjoy the breathtaking panoramic views of the city and gardens of this peaceful neighborhood. Ideal for business professionals for mid to long term stays.The apartment includes:• Smart TV• Full electrical appliances • Fully equipped kitchen • Huge balconies with sitting areas • Fast internet • A/C in all areas• Alarm system • Entrance camera system Building amenities:• Elevator• Cleaning services • Laundry services• Customer Service Support• Covered parking area - 200m from the emblematic Trilogy Project and the beachfront road- 2km from the tourist area of Limassol- 1.5km from Limassol Marina and the old portBooking from 1 to 12 months are available. Everything is included (bed linens, towels, kitchen equipment etc.)", "id": "4159181", "location": "Limassol district, Limassol - Neapolis", "price": "2500.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4159181_2-bedroom-apartment-to-rent/"}, {"date": "28.04.2022 15:14", "description": "This is a magnificent house suitable for a variety of purposes.It is located in Agioi Omologites close to Junior School, very close to the center of Nicosia.The house features 8 bedrooms overall (4 of them are en-suite) and many areas that can be used for dining, sitting, working or as play rooms.More specifically entering the ground-floor level, the entrance hall leads to the main areas of the house, where the dining room is, the living room and two more sitting lounges and the bar area. On the same level there is of course the very spacious, separated and equipped kitchen, the guest wc and a guest room which features walk-in closet, en-suite shower and wc, and it's private small kitchen.There is a nice staircase that leads to the upper-level and to a very bright open area suitable for study of as an extra sitting lounge. From there you can access externally a very nice front balcony and internally the corridor that leads to the main bathroom, the laundry room that can also be used as a kitchenette and 6 more bedrooms, 2 of them are en-suite with spacious bathrooms. Some of the bedrooms feature nice balconies.Externally, all around the house there are nice porch like verandas, BBQ facilities, gardens and garden trees, and also a storage room, and a staircase leading to a basement service room which is again en-suite with it's own shower and wc.The house also features air-conditioning in all areas, central heating, marble floors at ground-floor level, basic electrical equipment, 2 parking areas (one can fit two cars) and it is offered UNFURNISHED.Overall this property is suitable for any family that appreciates big spaces and the excellent residential location close to all amenities, but it is also ideal for other purposes, like an Embassy, an office, a medical center, etc.", "id": "4021628", "location": "Lefkosia (Nicosia) district, Agioi Omologites", "price": "3000.00", "title": "8-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4021628_8-bedroom-detached-house-to-rent/"}, {"date": "02.05.2022 20:10", "description": "New VILLA, 2 mins from coral bay beach. Fully furnished for long term rent. (Agent commission 2000)", "id": "4025463", "location": "Paphos district, Pegeia", "price": "3000.00", "title": "3-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/4025463_3-bedroom-semi-detached-to-rent/"}, {"date": "Yesterday 16:00", "description": "-Walking distance to 2 parks a Fully renovated 3 bed semi detached house fully nicely furnished and equipped in a quiet neighborhood near Metro supermarket in Aglanjia ready to move in.-Big sitting and dining area bright and spacious with front verandas.- Big separate kitchen fully equipped with all branded electrical appliances and family breakfast area with back side veranda.-3 spacious bedrooms one with double bed and other 2 with single beds all with external shutters.-1 full bathroom and guest w/c .-Central heating with diesel, full a/c, solar panels and small side and back garden with trees .-Pets are not allowed.-For more information contact us on CHAT.", "id": "3909515", "location": "Lefkosia (Nicosia) district, Aglantzia", "price": "1500.00", "title": "3-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/3909515_3-bedroom-semi-detached-to-rent/"}, {"date": "11.04.2022 09:48", "description": "Amazing and very private 2bed apartment available for holiday within the famous Aphrodite Hills Golf Res. On the entering you will find opens space living room with kitchen and 2 double bedrooms both en-suite. Patio doors from the living room leads to a private covered veranda and stairs down there is private garden. In the complex there is massive double size salt pool and children's pool with a little playground. The apartment is within the Aphrodite Hills Golf Course and is available from end of June 2022", "id": "4124009", "location": "Paphos district, Kouklia Pafou", "price": "2500.00", "title": "2-bedroom ground floor apartment to rent", "url": "www.bazaraki.com/adv/4124009_2-bedroom-ground-floor-apartment-to-rent/"}, {"date": "28.04.2022 10:53", "description": "3 bedroom Beach Villa, fully furnished, located in the beautiful tourist area of Oroklini, Larnaca. AVAILABLE FROM 20 JUNE 2022The villa comes with a private parking space, private garden, air-condition split system, Central Heating system using Gas, as well as a modern open plan kitchen with all electrical appliances included and an open plan living and dining room area.The ideal location has walking distance to the beach and luxury resorts and it is surrounded by a various amenities such as beach bars, restaurants, cozy cafeterias and mini markets which can also be accessed by foot.There is incredibly easy access to the main roads and even the highway which can offer convenience to the tenants.NO PETS ARE ALLOWED PRICE INCLUDES ALL COMMON EXPENSES EXCEPT ELECTRICITY AND WATER BILLSFor more information, please contact us on e-mail kyriacosf@gmail.com or at mob. 99-424309*Three Bedroom* Beach villa (50m from the beautiful blue flag Oroklini beach)*Tourist area with fancy restaurants/ bars ets.* New villa*New bathroom, new shower and new accessories*Fully furnished with new furniture’s.*New Air conditioning units in all rooms*Central Heating -Gas* Open plan living area*Private Parking space and private garden area.* Near the 5stars Radisson Beach Resort Larnaca", "id": "4149024", "location": "Larnaca district, Oroklini Tourist Area", "price": "1850.00", "title": "3-bedroom villa to rent", "url": "www.bazaraki.com/adv/4149024_2-bedroom-ground-floor-apartment-to-rent/"}, {"date": "27.04.2022 05:09", "description": "INCLUDING ELECTRICITY, WATER, INTERNET, COMMON EXPENSES AND REFUSE COLLECTING TAX IN MONTHLY PRICE. THIS IS A GREAT PACKAGE DEAL.- NO AGENTS PLEASE.- APARTMENT WILL BE READY 1ST JULY 2022.- 29 euros daily, all inclusive.- This is a NO SMOKING flat. - Perfect for travellers.- No pets allowed.- Minimum 2 months rent. - 2 months upfront rent.- Only adults. 2 adults maximum.Lovely modern studio on the beachfront in prime mackenzie location.A very cosy and modern studio on the third floor with 2 lifts, some meters from the sea with city view. The building is on the front row on the main road, opposite the beach.At the full of life mackenzie area with many restaurants, bars and clubs. There is a massive gym in this area too. Close to water sports. At the building, there is a diving school also. With renovated bathroom, kitchen, wardrobe, new air-conditioning and a new queen size bed. Beautiful and clean with a flat screen TV opposite the bed, surrounded by very artistic paintings, giving this space a unique welcoming and vibrant feeling. Stylish lamp shades on either side of the bed, creating a very relaxed atmosphere. Also, double plug sockets are on both sides of the bed, enabling guests to comfortably charge their mobile devices whilst relaxing. Also, there is an extra table that can unfold for your use. House manual:The apartment has a water heating system that you can choose how long you want the electricity to heat the water. This is mainly used for shower purposes when the weather is not very hot and the water needs to be heated. Adequately, 30 minutes is enough to heat the water before taking a shower. This device is located at the entrance of the studio apartment. Also, you will find a card key system at the entrance. This card needs to be in its place to keep the electricity on. Once removed from its place, the electricity stays on for another 30 seconds. The key and the red plastic card are connected together and must not be separated. Only 1 key is given because it is a hotel style card key system.", "id": "3791204", "location": "Larnaca district, Larnaka - Makenzy", "price": "900.00", "title": "Studio apartment to rent", "url": "www.bazaraki.com/adv/3791204_studio-apartment-to-rent/"}, {"date": "02.05.2022 12:30", "description": "Our property is situated in just a perfect spot for those travelers who wish to enjoy the island’s tranquility yet stay in proximity to all the best Paphos has to offer. The quiet area of Kato Paphos, which is home to SOFIA Luxury Residence, is close to the famous Medieval Castle of Paphos and picturesque Agia Solomoni Church. And the beach with the beautiful sea promenade is only 700m away from the property.The modern apartment complex features an outdoor swimming pool and a panoramic terrace perfect for morning yoga, sunbathing, sunset drinks, or a fun private BBQ party. This is the one & only rooftop terrace with such a breath-taking sea view in Paphos.This apartment has 2 separated Queen-bed rooms, offer a living and dining area with LCD flat-screen TV, hardwood and marble flooring, while 2 bathrooms are included. All functions are activated by Smart Home system.The climate is supported by a modern VRV systems, coziness in winter evenings will provide a Central floor heating.Free high-speed 500/80 Mbps WiFi is provided, which is ideal for those working remotely.King's Avenue Mall, the largest shopping mall of Paphos is only 8 min walk away, and the fun bar & restaurant zone is two blocks away, so you can always be in the epicenter of local life, yet enjoying the tranquillity of the SOFIA Luxury Residence.Our attentive and friendly team is at your service 24/7, ready to cater to any need our guests might have or follow on a special request", "id": "4129228", "location": "Paphos district, Geroskipou Tourist Area", "price": "2500.00", "title": "2-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4129228_2-bedroom-apartment-to-rent/"}, {"date": "Today 16:51", "description": "FOR RENT 3 BEDROOM LUXURY UPPERHOUSE IN PERISTERONA AREA NICOSIA.✔180 SQM INTERNAL AREA✔3 BATHROOMS✔AVAILABLEPRICE: 750.00 P.H. S.L.V.A.M. 800 | A.A. 389InFo: 96369500", "id": "4160700", "location": "Lefkosia (Nicosia) district, Peristerona Lefkosias", "price": "750.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4160700_3-bedroom-semi-detached-to-rent/"}, {"date": "Today 16:51", "description": "FOR RENT 3 BEDROOM LUXURY UPPERHOUSE IN PERISTERONA AREA NICOSIA. ✔180 SQM INTERNAL AREA ✔3 BATHROOMS ✔AVAILABLE PRICE: 750.00 P.H. S.L.V. A.M. 800 | A.A. 389", "id": "4160700", "location": "Lefkosia (Nicosia) district, Peristerona Lefkosias", "price": "750.00", "title": "3-bedroom detached house to rent", "url": "www.bazaraki.com/adv/4160700_3-bedroom-semi-detached-to-rent/"}, {"date": "Today 16:55", "description": "LATSIA, ONE BEDROOM, 77SM PLUS VERANDAS, APPLIANCES, COVERED PARKINGNO REAL ESTATE AGENTS", "id": "4160806", "location": "Lefkosia (Nicosia) district, Latsia - Agios Georgios", "price": "450.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160806_1-bedroom-apartment-to-rent/"}, {"date": "Today 18:00", "description": "Modern 1 Bedroom Apartment For Rent. Fully Furnished.Fully Airconditioned and Electric Heating.All Appliances included (Fridge, Hob and Oven, Extractor, Washing Machine, Dryer, TV).Great Location close to all amenities.Easy access to the highway.Covered parking and storage.Building in a great condition (approx. 10 years old) Common Expenses included in the price. Small dogs and cats allowed.", "id": "4160878", "location": "Limassol district, Polemidia Kato", "price": "850.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160878_1-bedroom-apartment-to-rent/"}, {"date": "Today 17:24", "description": "1 bedroom flat, 3rd floor, fully furnished, near the centre and near universities.Split units and hot water from solar power.", "id": "4160832", "location": "Lefkosia (Nicosia) district, Palouriotissa", "price": "480.00", "title": "1-bedroom apartment to rent", "url": "www.bazaraki.com/adv/4160832_1-bedroom-apartment-to-rent/"}, {"date": "Today 09:30", "description": "1 bedroom ground floor house fully furnished in Apostolos Andreas area. Free Internet Cablenet Purple Max. The house is near many amenities pharmacies, shops, kiosk, etc. Quiet neighborhood with easy access to both highway and seaside. Fully furnished, including home appliances, air condition only in the living room, however can also cover the bedroom if the door remain open. To be rent only to 1 person, not couples.", "id": "4160158", "location": "Limassol district, Limassol - Apostolos Andreas", "price": "750.00", "title": "1-bedroom semi-detached to rent", "url": "www.bazaraki.com/adv/4160158_1-bedroom-semi-detached-to-rent/"}]